---
kind: other
id: Methods.T:Autodesk.Revit.DB.RevitLinkOperations
source: html/667b479c-30fc-0e3c-7412-e8d8c046aece.htm
---
# RevitLinkOperations Methods

Sets the IGetLocalPathForOpenCallback that will support the "Open (and Unload)" command for Revit links
 obtained from an IExternalResourceServer.